'''
Створіть масив з п'яти прізвищ і виведіть на екран ті з них, які
починаються з певної букви, яка вводиться з клавіатури.
'''
import numpy as np

l = input('enter your letter')
X = np.array(['Слободянюк', 'Васильченко', 'Опанасюк', 'Юрчук', 'Рощенюк'])  # створкння списку з 5 елементів
X_2 = np.array([])  # створення порожнього масиву
for i in range(len(X)):
    if X[i][0] == l:  # перевірка першої літери на відповідність
        X_2 = np.append(X_2, X[i])  # записи прізвища в новий масив
print(X_2)
