'''
Задана таблиця назв товарів, що випускаються заводом. Визначте, чи
повторюється в цій таблиці назва першого товару, і, якщо повторюється, видаліть
назву першого товару з таблиці.
'''
import numpy as np
from random import choice

l = ['коректор', 'зошит', 'книга', 'коректор', 'ручка', 'коректор', 'книга', 'зошит',
 'ручка', 'зошит', 'коректор', 'зошит', 'зошит', 'книга', 'блокнот']
print(l)
if l.count(l[0]) > 1:
    n = l[0]
    for i in l:
        if n == i:
            l.remove(i)
print(l)


