'''
Дан одновимірний масив а. Сформувати новий масив, який складається
тільки з тих елементів масиву а, які перевищують свій номер на 10. Якщо таких
елементів немає, то видати повідомлення.
'''
import numpy as np

A = np.random.randint(0, 20, 15)
A_2 = np.array([])
for i in range(len(A)):
    if A[i]-10 > i:
        A_2 = np.append(A_2, A[i])
print(A)
print(A_2)


